In [95]:
import pandas as pd
import numpy as np
import os

# visualize
import seaborn as sns
import matplotlib.pyplot as plt

# acquire
from env import host, user, password
from pydataset import data

In [96]:
# use a python module (pydata or seaborn datasets) containing datasets as a 
# source from the iris data. Create a pandas dataframe, df_iris, from this data.
df_iris = data('iris')

In [97]:
# print the first 3 rows
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [98]:
# print the number of rows and columns
df_iris.shape

(150, 5)

In [99]:
# print the column names
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [100]:
# print the data type of each column
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [101]:
# print the summary statistics for each of the numeric variables. Would 
# you recommend rescaling the data based on these statistics
df_iris.describe()   # .T can be used to transpose columns and rows

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [102]:
df_excel = pd.read_excel('Excel_Exercises.xlsx', sheet_name='Table1_CustDetails')

In [103]:
df_excel.head(3)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,phone_type,internet_service,internet_type,contract_type,...,is_female,has_churned,has_phone,has_internet,has_phone_and_internet,partner_dependents,Start_Date,average_monthly_charges,Match,service_type
0,0002-ORFBO,Female,0,Yes,Yes,1,One Line,1,DSL,1,...,True,False,True,True,True,3,2020-08-13,65.9222,No Match,Phone + Internet
1,0003-MKNFE,Male,0,No,No,2,Two or More Lines,1,DSL,0,...,False,False,True,True,True,0,2020-08-13,60.2667,No Match,Phone + Internet
2,0004-TLHLJ,Male,0,No,No,1,One Line,2,Fiber Optic,0,...,False,True,True,True,True,0,2021-01-13,70.2125,No Match,Phone + Internet

In [104]:
# assign the first 100 rows to a new dataframe, df_excel_sample

df_excel_sample = df_excel.head(100)

In [105]:
df_excel_sample.shape

(100, 26)

In [106]:
# print the number of rows of your original dataframe

df_excel.shape[0]

7049

In [107]:
# print the first 5 column names

df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [109]:
# print the column names that have a data type of object

list(df_excel.select_dtypes(['object']).columns)

['customer_id',
 'gender',
 'partner',
 'dependents',
 'phone_type',
 'internet_type',
 'contract_length',
 'payment_type',
 'churn',
 'average_monthly_charges',
 'Match',
 'service_type']

In [110]:
df_excel.describe()

,is_senior_citizen,phone_service,internet_service,contract_type,monthly_charges,total_charges,Tenure,partner_dependents
count,7049.000000,7049.000000,7049.000000,7049.000000,7049.000000,7038.000000,7049.000000,7049.000000
mean,0.162009,1.324585,1.222585,0.690878,64.747014,2283.043883,32.374805,1.083416
std,0.368485,0.642709,0.779068,0.833757,30.099460,2266.521984,24.596637,1.226883
min,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000,0.000000,0.000000
25%,0.000000,1.000000,1.000000,0.000000,35.450000,401.587500,9.000000,0.000000
50%,0.000000,1.000000,1.000000,0.000000,70.350000,1397.100000,29.000000,1.000000
75%,0.000000,2.000000,2.000000,1.000000,89.850000,3793.775000,55.000000,2.000000
max,1.000000,2.000000,2.000000,2.000000,118.750000,8684.800000,79.000000,3.000000

In [82]:
# compute the range for each of the numeric variables.

df_excel.select_dtypes(['int64', 'float64']).max() - df_excel.select_dtypes(['int64', 'float64']).min()

is_senior_citizen        1.0
phone_service            2.0
internet_service         2.0
contract_type            2.0
monthly_charges        100.5
total_charges         8666.0
Tenure                  79.0
partner_dependents       3.0
dtype: float64

### 3. Read the data from this google sheet into a dataframe, df_google

In [111]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_googlesheet = pd.read_csv(csv_export_url)

In [112]:
# print the first 3 rows

df_googlesheet.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [59]:
# print the number of rows and columns

df_googlesheet.shape

(891, 12)

In [88]:
# print the column names

df_googlesheet.columns

Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'deck', 'embark_town', 'alone'],
      dtype='object')

In [89]:
df_googlesheet.dtypes

passenger_id      int64
survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class            object
deck             object
embark_town      object
alone             int64
dtype: object

In [90]:
# print the summary statistics for each of the numeric variables

df_googlesheet.describe

<bound method NDFrame.describe of      passenger_id  survived  pclass     sex   age  sibsp  parch     fare  \
0               0         0       3    male  22.0      1      0   7.2500
1               1         1       1  female  38.0      1      0  71.2833
2               2         1       3  female  26.0      0      0   7.9250
3               3         1       1  female  35.0      1      0  53.1000
4               4         0       3    male  35.0      0      0   8.0500
..            ...       ...     ...     ...   ...    ...    ...      ...
886           886         0       2    male  27.0      0      0  13.0000
887           887         1       1  female  19.0      0      0  30.0000
888           888         0       3  female   NaN      1      2  23.4500
889           889         1       1    male  26.0      0      0  30.0000
890           890         0       3    male  32.0      0      0   7.7500

    embarked   class  deck  embark_town  alone
0          S   Third  None  Southampton      0
1          C   First     C    Cherbourg      0
2          S   Third  None  Southampton      1
3          S   First     C  Southampton      0
4          S   Third  None  Southampton      1
..       ...     ...   ...          ...    ...
886        S  Second  None  Southampton      1
887        S   First     B  Southampton      1
888        S   Third  None  Southampton      0
889        C   First     C    Cherbourg      1
890        Q   Third  None   Queenstown      1

[891 rows x 13 columns]>

In [114]:
# print the unique values for each of your categorical variables

df_googlesheet.select_dtypes('object').nunique()

Name        891
Sex           2
Ticket      681
Cabin       147
Embarked      3
dtype: int64

In [115]:
df_googlesheet.Survived.value_counts(dropna=False)

0    549
1    342
Name: Survived, dtype: int64

In [116]:
df_googlesheet.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [117]:
df_googlesheet.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [118]:
df_googlesheet.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

#### 3. Once you've got your get_titanic_data and get_iris_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for a local filename like titanic.csv or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.¶

In [119]:
from acquire import get_connection, new_titanic_data, get_titanic_data, new_iris_data, get_iris_data

In [120]:
df = get_titanic_data()
df.head(2)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0

In [121]:
df = get_titanic_data(cached=True)
df.head(2)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0

In [122]:
df = get_iris_data()
df.head(2)

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa

### Data Preparation Exercises

#### The end product of this exercise should be the specified functions in a python script named prepare.py. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

#### This work should all be saved in your local classification-exercises repo. Then add, commit, and push your changes.

#### 1. Use the function defined in acquire.py to load the iris data.

In [123]:
df.head(2)

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa

#### 2. Drop the species_id and measurement_id columns.

In [124]:
df = df.drop(columns=['species_id', 'measurement_id'])

#### 3. Rename the species_name column to just species.

In [125]:
df = df.rename(columns={'species_name': 'species'})

#### 4. Create dummy variables of the species name.

In [126]:
dummy_df = pd.get_dummies(df[['species']], dummy_na=False, drop_first=[True])

In [127]:
# concat dummy_df with my df
df = pd.concat([df,dummy_df], axis = 1)

#### 5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [134]:
df = acquire.get_iris_data()

In [135]:
def prep_iris(df):
    '''
    takes in a df of the iris dataset as it is acquired and returns a cleaned df
    arguements: df: a pandas df with the expected feature names and columns return: 
    clean_df: a dataframe with the cleaning operations performed on it
    '''
    df = df.drop_duplicates()
    df = df.drop(columns = ['species_id'])
    df = df.rename(columns={"species_name": "species"})
    dummy_species_name = pd.get_dummies(df[['species']]) 
    return df

In [136]:
# then for the py file, copy and paste the functions
# copy and paste docuscript from the lesson and change 
#titanic to iris